Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Compression functions are initialized with default state information whenever a connection state is made active.
zh_cn: 只要激活连接状态，就会使用默认状态信息初始化压缩函数。

source: Compression must be lossless and may not increase the content length by more than 1024 bytes.
zh_cn: 压缩必须是无损的，并且内容长度不能增加超过 1024 字节。

source: Compute T = R * (2**N), where N is the number of previous retries of this request.
zh_cn: 计算 T = R *(2 ** N)，其中 N 是此请求的先前重试次数。

source: Computer languages are explicitly excluded.
zh_cn: 明确排除计算机语言。

source: Computing the Master Secret
zh_cn: 计算主密钥

source: Conceptually, HTTP/TLS is very simple.
zh_cn: 从概念上讲，HTTP/TLS 非常简单。

source: Conceptually, it is a union of `Single` and `Completable` providing the means to capture an emission pattern where there could be 0 or 1 item or an error signalled by some reactive source.
zh_cn: 从概念上讲，它是 `Single` 和 `Completable` 的结合，提供捕获发射模式的方法，这些模式可能存在 0 或 1 个项或由某些响应源发出的错误信号。

source: Concerns with TLS 1.2 implementations falling back to SHA-1 is an issue.
zh_cn: 关注 TLS 1.2 实现回归 SHA-1 是一个问题。

source: Concurrency
zh_cn: 并发

source: Conditional and Boolean Operators
zh_cn: 条件和布尔操作符

source: Confirmation by user-agent software with semantic understanding of the application MAY substitute for user confirmation.
zh_cn: 具有对应用程序的语义理解的用户代理软件的确认可以替代用户确认。

source: Conformance and Error Handling
zh_cn: 一致性和错误处理

source: Conformance criteria and considerations regarding error handling are defined in Section 2.5 of [RFC7230].
zh_cn: 有关错误处理的一致性标准和注意事项在 [RFC7230] 的第 2.5 节中定义。

source: Conformance criteria and considerations regarding error handling are defined in Section 2.5.
zh_cn: 有关错误处理的一致性标准和注意事项在第 2.5 节中定义。

source: Conformance includes both the syntax and semantics of protocol elements.
zh_cn: 一致性包括协议元素的语法和语义。

source: Connectable Observable Operators
zh_cn: Connectable Observable 操作符

source: Connecting Inbound
zh_cn: 连接入站

source: Connection
zh_cn: 连接

source: Connection Closure
zh_cn: 连接关闭

source: Connection Establishment and Clearing
zh_cn: 连接建立和清除

source: Connection Initiation
zh_cn: 连接启动

source: Connection Management
zh_cn: 连接管理

source: Connection States
zh_cn: 连接状态

source: Connection options are case-insensitive.
zh_cn: 连接选项不区分大小写。

source: Connections
zh_cn: 连接

source: Connections can be closed at any time, with or without intention.
zh_cn: 无论是否有意，都可以随时关闭连接。

source: Consequently, common practice has been to run HTTP/TLS over a separate port in order to distinguish which protocol is being used.
zh_cn: 因此，通常的做法是在单独的端口上运行 HTTP/TLS，以区分正在使用的协议。

source: Consequently, this specification does not use ABNF rules to define each "Field-Name: Field Value" pair, as was done in previous editions.
zh_cn: 因此，此规范不使用 ABNF 规则来定义每个“Field-Name: Field Value”对，如在先前版本中所做的那样。

source: Consequently, we must adopt rules for implicitly assigning sequence numbers to control.
zh_cn: 因此，我们必须为控制位采用隐式分配序列号的规则。

source: Considering that a resource could be anything, and that the uniform interface provided by HTTP is similar to a window through which one can observe and act upon such a thing only through the communication of messages to some independent actor on the other side, an abstraction is needed to represent ("take the place of") the current or desired state of that thing in our communications.
zh_cn: 考虑到一个资源可以是任何东西，并且 HTTP 提供的统一接口类似于一个窗口，通过这个窗口，只有通过将消息传递给另一方的某个独立的参与者，才能观察和处理这样的东西，因此需要一个抽象来表示(代替)我们通讯中该事物的当前或期望状态。

source: Constructing Responses From Caches
zh_cn: 从缓存构造响应

source: Content Coding Registration
zh_cn: 内容编码注册

source: Content Coding Registry
zh_cn: 内容编码注册

source: Content Codings
zh_cn: 内容编码

source: Content Negotiation
zh_cn: 内容协商

source: Content coding values indicate an encoding transformation that has been or can be applied to an entity.
zh_cn: 内容编码值指示已经或可以应用于实体的编码变换。

source: Content codings are primarily used to allow a document to be compressed or otherwise usefully transformed without losing the identity of its underlying media type and without loss of information.
zh_cn: 内容编码主要用于允许文档被压缩或以其他方式有用地转换而不会丢失其基础媒体类型的身份并且不会丢失信息。

source: Content negotiation MAY be used to select the appropriate response format.
zh_cn: 内容协商可用于选择适当的响应格式。

source: Content-Disposition
zh_cn: 内容处置

source: Content-Disposition Issues
zh_cn: 内容处理问题

source: Content-Encoding may be used to indicate any additional content codings applied to the data, usually for the purpose of data compression, that are a property of the requested resource.
zh_cn: 内容编码可用于指示应用于数据的任何附加内容编码，通常用于数据压缩的目的，其是所请求资源的属性。

source: Content-Type specifies the media type of the underlying data.
zh_cn: Content-Type 指定基础数据的媒体类型。

source: Control Data
zh_cn: 控制数据

source: Control information is not physically carried in the segment data space.
zh_cn: 控制信息不是在报文段数据空间中物理携带的。

source: Conventions and Terminology
zh_cn: 惯例和术语

source: Conversion of Date Formats
zh_cn: 日期格式的转换

source: Conversion to Canonical Form
zh_cn: 转换为规范形式

source: Converting Observables
zh_cn: 转换 Observable

source: Cookies serve two primary purposes:
zh_cn: Cookie 主要用于两个目的：

source: Copyright Notice
zh_cn: 版权声明

source: Counts the number of elements in the sequence
zh_cn: 计算序列中的元素数量

source: Creating Observables
zh_cn: 创建 Observable

source: Creating backpressured data sources is the relatively easier task when dealing with backpressure in general because the library already offers static methods on `Flowable` that handle backpressure for the developer.
zh_cn: 在处理背压时，创建背压数据源是相对容易的任务，因为库已经在 `Flowable` 上提供了静态方法，可以让开发人员处理背压。

source: Cryptographic Computations
zh_cn: 密码计算

source: Cryptographic Negotiation
zh_cn: 加密协商

source: Cryptographic keys are implied by the current session state (see Section 6.1).
zh_cn: 加密密钥由当前会话状态隐含(参见第 6.1 节)。

source: Cryptographic security: TLS should be used to establish a secure connection between two parties.
zh_cn: 加密安全性：应使用 TLS 在双方之间建立安全连接。

source: Current Segment Variables
zh_cn: 当前报文段变量

source: Current ServerHello messages additionally contain either the "pre_shared_key" extension or the "key_share" extension, or both (when using a PSK with (EC)DHE key establishment).
zh_cn: 当前的 ServerHello 消息还包含“pre_shared_key”扩展或“key_share”扩展，或两者兼有(当使用带有 (EC)DHE 密钥建立的 PSK 时)。

source: Current practice is to layer HTTP over SSL (the predecessor to TLS), distinguishing secured traffic from insecure traffic by the use of a different server port.
zh_cn: 当前的做法是通过 SSL(TLS 的前身)对 HTTP 进行分层，通过使用不同的服务器端口来区分安全流量和不安全流量。

source: Currently defined options include (kind indicated in octal):
zh_cn: 目前定义的选项包括(以八进制表示的种类)：

source: Currently, DSA [DSS] may only be used with SHA-1.
zh_cn: 目前，DSA [DSS] 只能与 SHA-1 一起使用。

source: Currently, the client_write_IV and server_write_IV are only generated for implicit nonce techniques as described in Section 3.2.1 of [AEAD].
zh_cn: 目前，client_write_IV 和 server_write_IV 仅为隐式随机数技术生成，如 [AEAD] 的第 3.2.1 节所述。

source: DIGIT = <any US-ASCII digit "0".."9">
zh_cn: DIGIT = <任何 US-ASCII 数字 "0".."9">

source: DIGIT (decimal digits), DQUOTE (double quote), HEXDIG (hexadecimal digits), LF (line feed), and SP (space).
zh_cn: DIGIT(十进制数字)，DQUOTE(双引号)，HEXDIG(十六进制数字)，LF(换行)和 SP(空格)。

source: DNS Spoofing
zh_cn: DNS 欺骗

source: Data Communication
zh_cn: 数据通讯

source: Data in character sets other than "ISO-8859-1" or its subsets MUST be labeled with an appropriate charset value.
zh_cn: 除“ISO-8859-1”或其子集之外的字符集中的数据必须用适当的字符集值标记。

source: Dataflows can fail, at which point the error is emitted to the consumer(s).
zh_cn: 数据流可能会失败，此时错误会发送给消费者。

source: Date/Time Formats
zh_cn: 日期/时间格式

source: Decoding Chunked
zh_cn: 解码块

source: Decrypt the message to recover the plaintext M
zh_cn: 解密消息以恢复明文 M

source: Default Base URI
zh_cn: 默认基本 URI

source: Default Schedulers for RxGroovy Observable Operators
zh_cn: RxGroovy Observable 操作符的默认调度器

source: Default values are 0 and infinity so that "#element" allows any number, including zero;
zh_cn: 默认值为 0 和无穷大，以便“#element”允许任何数字，包括零；

source: Default values are 0 and infinity so that "*(element)" allows any number, including zero; "1*element" requires at least one; and "1*2element" allows one or two.
zh_cn: 默认值为 0 和无穷大，因此“*(element)”允许任何数字，包括零；“1*element”至少需要一个；并且“1*2element”允许一个或两个。

source: Define a method that does something useful with the return value from the asynchronous call; this method is part of the observer.
zh_cn: 定义一个方法，该方法对异步调用的返回值执行一些有用的操作；此方法是 observer 的一部分。

source: Define the asynchronous call itself as an Observable.
zh_cn: 将异步调用本身定义为 Observable。

source: Defined structures may have variants based on some knowledge that is available within the environment.
zh_cn: 定义的结构可能具有基于环境中可用的一些知识的变体。

source: Defining a new connection option essentially reserves that potential field-name for carrying additional information related to the connection option, since it would be unwise for senders to use that field-name for anything else.
zh_cn: 定义新的连接选项实质上保留了潜在的字段名称，用于携带与连接选项相关的附加信息，因为发送者将该字段名称用于其他任何内容是不明智的。

source: Delayed and Periodic Schedulers
zh_cn: 延迟和周期调度器

source: Delimiters are chosen from the set of US-ASCII visual characters not allowed in a token (DQUOTE and "(),/:;<=>?@[\]{}").
zh_cn: 分隔符是从标记中不允许的 US-ASCII 可视字符集中选择的(DQUOTE 和 "(),/:;<=>?@[\]{}")。

source: Denial of Service Attacks on Proxies
zh_cn: 对代理的拒绝服务攻击

source: Depending on the operating system supporting A's TCP, it is likely that some error recovery mechanism exists.
zh_cn: 根据支持 A 的 TCP 的操作系统，可能存在一些错误恢复机制。

source: Depending on the type, matching certificate extension values are not necessarily bitwise-equal.
zh_cn: 根据类型，匹配的证书扩展值不一定是按位相等的。

source: Derivation of traffic keys is defined in Section 7.3.
zh_cn: 第 7.3 节定义了通信密钥的派生。

source: Derive-Secret is called with four distinct transcripts; in a 1-RTT-only exchange, it is called with three distinct transcripts.
zh_cn: Derive-Secret 被称为四个不同的 transcripts；在 1-RTT-only 交换中，它被称为三个不同的 transcripts。

source: Deriving a shared secret from a password or other low-entropy sources is not secure.
zh_cn: 从密码或其他低熵源获取共享密钥并不安全。

source: Design Considerations
zh_cn: 设计注意事项

source: Designers and implementors should be aware of the fact that until the handshake has been authenticated, active attackers can modify messages and insert, remove, or replace extensions.
zh_cn: 设计人员和实现者应该意识到，在握手经过身份验证之前，主动攻击者可以修改消息并插入，删除或替换扩展。

source: Diffie-Hellman [DH76] parameters for both clients and servers are encoded in the opaque key_exchange field of a KeyShareEntry in a KeyShare structure.
zh_cn: 客户端和服务器的 Diffie-Hellman [DH76] 参数在 KeyShare 结构中的 KeyShareEntry 的 opaque key_exchange 字段中进行编码。

source: Disambiguating Expiration Values
zh_cn: 消除过期值的歧义

source: Disambiguating Multiple Responses
zh_cn: 消除多个响应的歧义

source: Disclosure of Fragment after Redirects
zh_cn: 重定向后的片段披露

source: Disclosure of Personal Information
zh_cn: 个人信息的披露

source: Disclosure of Product Information
zh_cn: 产品信息披露

source: Disclosure of Sensitive Information in URIs
zh_cn: 在 URI 中披露敏感信息

source: Distribution of this memo is unlimited.
zh_cn: 本备忘录的分发是无限的。

source: Due to interoperability problems with HTTP/1.0 proxies discovered since the publication of RFC 2068[33], caching proxies MUST, gateways MAY, and tunnels MUST NOT upgrade the request to the highest version they support.
zh_cn: 由于自 RFC 2068 [33] 发布以来发现的 HTTP/1.0 代理的互操作性问题，缓存代理必须，网关可以和隧道不得将请求升级到它们支持的最高版本。

source: Due to the Reactive-Streams specification, `Publisher.subscribe` returns void and the pattern by itself no longer works in 2.0.
zh_cn: 由于 Reactive-Streams 规范，`Publisher.subscribe` 返回 void，该模式本身不再适用于 2.0。

source: Due to the name conflict, replacing the package from `rx` to `org.reactivestreams` is not enough.
zh_cn: 由于名称冲突，将包从 `rx` 替换为 `org.reactivestreams` 是不够的。

source: Due to zero windows and zero length segments, we have four cases for the acceptability of an incoming segment:
zh_cn: 由于零窗口和零长度报文段，我们有四种情况可以接受传入的报文段：

source: E.g., *.a.com matches foo.a.com but not bar.foo.a.com.
zh_cn: 例如，*.a.com 匹配 foo.a.com 但不匹配 bar.foo.a.com。

source: ECDHE parameters for both clients and servers are encoded in the opaque key_exchange field of a KeyShareEntry in a KeyShare structure.
zh_cn: 客户端和服务器的 ECDHE 参数在 KeyShare 结构中的 KeyShareEntry 的 opaque key_exchange 字段中进行编码。

source: ECDSA algorithms: Indicates a signature algorithm using ECDSA [ECDSA], the corresponding curve as defined in ANSI X9.62 [ECDSA] and FIPS 186-4 [DSS], and the corresponding hash algorithm as defined in [SHS].
zh_cn: ECDSA 算法：表示使用 ECDSA [ECDSA] 的签名算法，ANSI X9.62 [ECDSA] 和 FIPS 186-4 [DSS] 中定义的相应曲线，以及 [SHS] 中定义的相应散列算法。

source: ESTABLISHED - represents an open connection, data received can be delivered to the user.
zh_cn: ESTABLISHED - 表示开放连接，接收的数据可以传递给用户。

source: Each AEAD cipher MUST NOT produce an expansion of greater than 1024 bytes.
zh_cn: 每个 AEAD 加密不得产生大于 1024 字节的扩展。

source: Each AEAD cipher suite MUST specify how the nonce supplied to the AEAD operation is constructed, and what is the length of the GenericAEADCipher.nonce_explicit part.
zh_cn: 每个 AEAD 加密套件必须指定如何构造提供给 AEAD 操作的随机数，以及 GenericAEADCipher.nonce_explicit 部分的长度是多少。

source: Each Hypertext Transfer Protocol (HTTP) message is either a request or a response.
zh_cn: 每个超文本传输​​协议(HTTP)消息都是请求或响应。

source: Each KeyShareEntry value MUST correspond to a group offered in the "supported_groups" extension and MUST appear in the same order.
zh_cn: 每个 KeyShareEntry 值必须对应于“supported_groups”扩展中提供的组，并且必须以相同的顺序出现。

source: Each SignatureAndHashAlgorithm value lists a single hash/signature pair that the client is willing to verify.
zh_cn: 每个 SignatureAndHashAlgorithm 值列出客户端愿意验证的单个散列/签名对。

source: Each SignatureScheme value lists a single signature algorithm that the client is willing to verify.
zh_cn: 每个 SignatureScheme 值列出客户端愿意验证的单个签名算法。

source: Each TCP cycles from CLOSED to SYN-SENT to SYN-RECEIVED to ESTABLISHED.
zh_cn: 每个 TCP 从 CLOSED 到 SYN-SENT 循环到 SYN-RECEIVED 到 ESTABLISHED。

source: Each URI begins with a scheme name that refers to a specification for assigning identifiers within that scheme.
zh_cn: 每个 URI 都以一个方案名称开头，该方案名称引用了在该方案中分配标识符的规范。

source: Each URI begins with a scheme name, as defined in Section 3.1, that refers to a specification for assigning identifiers within that scheme.
zh_cn: 每个 URI 都以方案名称开头，如 3.1 节中所定义，它指的是在该方案中分配标识符的规范。

source: Each arm of the select (below) specifies the type of that variant's field and an optional field label.
zh_cn: select(下方)的每个臂指定该变体字段的类型和可选字段标签。

source: Each cipher suite defines a key exchange algorithm, a bulk encryption algorithm (including secret key length), a MAC algorithm, and a PRF.
zh_cn: 每个加密套件定义密钥交换算法，批量加密算法(包括密钥长度)，MAC 算法和 PRF。

source: Each connection applies to only one transport link.
zh_cn: 每个连接仅适用于一个传输链路。

source: Each connection state contains a sequence number, which is maintained separately for read and write states.
zh_cn: 每个连接状态都包含一个序列号，该序列号针对读取和写入状态单独维护。

source: Each connection state includes the following elements:
zh_cn: 每个连接状态包括以下元素：

source: Each definition is a different type.
zh_cn: 每个定义都是不同的类型。

source: Each encrypted record consists of a plaintext header followed by an encrypted body, which itself contains a type and optional padding.
zh_cn: 每个加密记录由一个明文首部后跟一个加密主体组成，该主体本身包含一个类型和可选的填充。

source: Each following certificate MUST directly certify the one preceding it.
zh_cn: 后续每个证书必须直接证明其前面的证书。

source: Each following certificate SHOULD directly certify the one immediately preceding it.
zh_cn: 后续每个证书都应该直接认证其前面的证书。

source: Each header field consists of a case-insensitive field name followed by a colon (":"), optional leading whitespace, the field value, and optional trailing whitespace.
zh_cn: 每个首部字段由不区分大小写的字段名称后跟冒号(“:”)，可选的前导空格，字段值和可选的尾随空格组成。

source: Each header field consists of a name followed by a colon (":") and the field value.
zh_cn: 每个首部字段由一个名称后跟一个冒号(“:”)和字段值组成。

source: Each language-specific implementation of ReactiveX has its own naming quirks.
zh_cn: ReactiveX 的每种语言特定实现都有自己的命名偏好。

source: Each language-specific implementation of ReactiveX implements a set of operators.
zh_cn: ReactiveX 的每个特定于语言的实现都实现了一组操作符。

source: Each line is numbered for reference purposes.
zh_cn: 每行都有编号以供参考。

source: Each of these is generated from the byte sequence in that order.
zh_cn: 这些中的每一个都是按照该顺序从字节序列生成的。

source: Each of these representations is termed a `varriant'.
zh_cn: 这些表示中的每一个都被称为“变体”。

source: Each operator in the chain modifies the Observable that results from the operation of the previous operator.
zh_cn: 链中的每个操作符都会修改由前一个操作符的运算产生的 Observable。

source: Each persistent connection applies to only one transport link.
zh_cn: 每个持久连接仅适用于一个传输链路。

source: Each piece is represented numerically in case-insensitive hexadecimal, using one to four hexadecimal digits (leading zeroes are permitted).
zh_cn: 每个部分用不区分大小写的十六进制数字表示，使用一到四个十六进制数字(允许前导零)。

source: Each protocol element in HTTP that allows a URI reference will indicate in its ABNF production whether the element allows any form of reference (URI-reference), only a URI in absolute form (absolute-URI), only the path and optional query components, or some combination of the above.
zh_cn: HTTP 中允许 URI 引用的每个协议元素将在其 ABNF 生成中指示该元素是否允许任何形式的引用(URI 引用)，仅允许绝对形式的 URI(absolute-URI)，仅包含路径和可选查询组件，或上述的某种组合。

source: Each reactive base class features operators that can perform such conversions, including the protocol conversions, to match some other type.
zh_cn: 每个反应基类都具有可以执行此类转换的运算符，包括协议转换，以匹配其他类型。

source: Each reactive base type `Flowable`, `Observable`, `Single`, `Maybe` and `Completable` feature a safe `create` operator that does the right thing regarding backpressure (for `Flowable`) and cancellation (all):
zh_cn: 每个响应基类 `Flowable`，`Observable`，`Single`，`Maybe` 和 `Completable` 都有一个安全的 `create` 操作符，可以对背压(对于 `Flowable`)和取消(对于所有)执行正确的操作：

source: Each representation should either define the fragment so that it corresponds to the same secondary resource, regardless of how it is represented, or should leave the fragment undefined (i.e., not found).
zh_cn: 每个表示应该定义片段，使其对应于相同的辅助资源，而不管它是如何表示的，或者应该使片段未定义(即，未找到)。

source: Each requested element triggers a state transition and computation of the returned value.
zh_cn: 每个请求的元素触发状态转换并返回值的计算。

source: Each resource is identified by a Uniform Resource Identifier (URI), as described in Section 2.7 of [RFC7230].
zh_cn: 每个资源由统一资源标识符(URI)标识，如 [RFC7230] 第 2.7 节中所述。

source: Each side must also receive the other side's initial sequence number and send a confirming acknowledgment.
zh_cn: 每一方还必须接收另一方的初始序列号并发送确认确认。

source: Each specification declares a new, unique type.
zh_cn: 每个规范都声明一种新的唯一类型。

source: Each uint8 in the padding data vector MUST be filled with the padding length value.
zh_cn: 填充数据 vector 中的每个 uint8 必须用填充长度值填充。

source: Early data is not permitted after a HelloRetryRequest.
zh_cn: HelloRetryRequest 后不允许早期数据。

source: EdDSA algorithms: Indicates a signature algorithm using EdDSA as defined in [RFC8032] or its successors.
zh_cn: EdDSA 算法：表示使用 [RFC8032] 或其后续版本中定义的 EdDSA 的签名算法。

source: Effective Request URI
zh_cn: 有效的请求 URI

source: Either of these would normally lead to renegotiation; when that is not appropriate, the recipient should respond with this alert.
zh_cn: 这些中的任何一个通常都会导致重新谈判；如果不合适，接收者应回复此警报。

source: Either party may initiate a close by sending a close_notify alert.
zh_cn: 任何一方都可以通过发送 close_notify 警报来发起关闭。

source: Either party may initiate the exchange of closing messages.
zh_cn: 任何一方都可以发起关闭消息的交换。

source: Elements enclosed in parentheses are treated as a single element.
zh_cn: 括在括号中的元素被视为单个元素。

source: Elements of the Internetwork System
zh_cn: 互联网络系统的要素

source: Elements separated by a bar ("|") are alternatives, e.g., "yes | no" will accept yes or no.
zh_cn: 由条(“|”)分隔的元素是可选的，例如，“yes | no”将接受 yes 或 no。

source: Ellipsis (...) indicates a segment which is still in the network (delayed).
zh_cn: 省略号(...)表示仍在网络中的报文段(延迟)。

source: Elliptic Curve Groups (ECDHE): Indicates support for the corresponding named curve, defined in either FIPS 186-4 [DSS] or [RFC7748].
zh_cn: 椭圆曲线组(ECDHE)：表示支持相应的命名曲线，在 FIPS 186-4 [DSS] 或 [RFC7748] 中定义。

source: Emits the element at the given index or completes
zh_cn: 在给定索引处发出元素或完成

source: Emits the element at the given index or the default
zh_cn: 发出给定索引的元素或默认值

source: Emits the first element or a `NoSuchElementException` if the source is empty
zh_cn: 发出第一​​个元素或如果源为空，则 `NoSuchElementException`

source: Emits the indexth element or a `NoSuchElementException`
zh_cn: 发出索引指示的元素或 `NoSuchElementException`

source: Emits the lastelement or a `NoSuchElementException` if the source is empty
zh_cn: 发出最后一个元素，或如果源为空，则 `NoSuchElementException`

source: Emits the one and only element, IndexOutOfBoundsException if the source is longer than 1 item or a `NoSuchElementException` if the source is empty
zh_cn: 发出唯一元素，如果源长度超过 1 个项，则发出 IndexOutOfBoundsException，如果源为空，则发出 `NoSuchElementException`

source: Emits the only element or completes
zh_cn: 发出唯一的元素或完成

source: Emits the only element or the default item
zh_cn: 发出唯一元素或默认项目

source: Emits the reduced value (or the initial value)
zh_cn: 发出减少的值(或初始值)

source: Emits the reduced value or completes
zh_cn: 发出减少的价值或完成

source: Emits the very first element or `NoSuchElementException`
zh_cn: 发出第一个元素或 `NoSuchElementException`

source: Emits the very first element or completes
zh_cn: 发出第一个元素或完成

source: Emits the very last element or completes
zh_cn: 发出最后一个元素或完成

source: Emits the very last element or the default item
zh_cn: 发出最后一个元素或默认项目

source: Emits true if all elements match the predicate
zh_cn: 如果所有元素都与谓词匹配，则返回 true

source: Emits true if any elements match the predicate
zh_cn: 如果任何元素与谓词匹配，则返回 true

source: Emits true if the source is empty
zh_cn: 如果源为空，则返回 true

source: Empty list elements in list productions (e.g., a list header field containing ", ,") have been deprecated.
zh_cn: 列表生成中的空列表元素(例如，包含“,,”的列表首部字段)已被弃用。

source: Encoding Sensitive Information in URI's
zh_cn: 在 URI 中编码敏感信息

source: Encoding for Compression or Integrity
zh_cn: 压缩或完整性编码

source: EncryptedExtensions: responses to ClientHello extensions that are not required to determine the cryptographic parameters, other than those that are specific to individual certificates.
zh_cn: EncryptedExtensions：对 ClientHello 扩展的响应，除了特定于单个证书的加密参数之外，不需要确定加密参数。

source: End-to-end and Hop-by-hop Headers
zh_cn: 端到端和逐跳首部

source: Endpoint Identification
zh_cn: 端点识别

source: Endpoints SHOULD NOT negotiate these algorithms but are permitted to do so solely for backward compatibility.
zh_cn: 端点不应该协商这些算法，但允许这样做只是为了向后兼容。

source: Enhancements and bugfixes will be synchronized between the two in a timely manner.
zh_cn: 增强功能和错误修正将在两者之间及时同步。

source: Entity
zh_cn: 实体

source: Entity Body
zh_cn: 实体主体

source: Entity Header Fields
zh_cn: 实体首部字段

source: Entity Length
zh_cn: 实体长度

source: Entity Tag Cache Validators
zh_cn: 实体标记缓存验证器

source: Entity Tags
zh_cn: 实体标签

source: Entity tags are used for comparing two or more entities from the same requested resource.
zh_cn: 实体标签用于比较来自相同请求资源的两个或更多个实体。

source: Entity-header fields define metainformation about the entity-body or, if no body is present, about the resource identified by the request.
zh_cn: 实体首部字段定义关于实体主体的元信息，或者，如果不存在主体，则定义关于由请求标识的资源的元信息。

source: Equivalence
zh_cn: 等价

source: Error Alerts
zh_cn: 错误警报

source: Error Handling Operators
zh_cn: 错误处理操作符

source: Error handling in the TLS Handshake protocol is very simple.
zh_cn: TLS 握手协议中的错误处理非常简单。

source: Errors or Incomplete Response Cache Behavior
zh_cn: 错误或不完整的响应缓存行为

source: Establishing Authority
zh_cn: 建立认证

source: Establishing Observers
zh_cn: 创建观察者

source: Establishing a Base URI
zh_cn: 建立基本 URI

source: Establishing a connection
zh_cn: 建立连接

source: Establishment
zh_cn: 建立

source: Even hosts which can remember the time of day and used it to select initial sequence number values are not immune from this problem (i.e., even if time of day is used to select an initial sequence number for each new connection incarnation).
zh_cn: 即使能够记住一天中的时间并且用它来选择初始序列号值的主机也不能免于这个问题(即，即使使用时间来为每个新的连接化身选择初始序列号)。
